In [8]:
import numpy as np
import pandas as pd

## Handling With Lack Of Data
## Groupby
## Concatenation (concat)
## Merge

# HANDLING WITH LACK OF DATA

In [9]:
dictionaryData = {"Istanbul": [30,29,np.nan],"Ankara": [20,np.nan,25],"Izmir": [30,25,35]}

weatherDataFrame = pd.DataFrame(dictionaryData)

In [10]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     30
1      29.0     NaN     25
2       NaN    25.0     35

In [11]:
weatherDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     30

In [12]:
weatherDataFrame.dropna(axis=1)

   Izmir
0     30
1     25
2     35

In [13]:
dictionaryDataNew = {"Istanbul": [30,29,np.nan],"Ankara": [20,np.nan,25],"Izmir": [30,25,35],"Antalya":[45,np.nan,np.nan]}

weatherDataFrameNew = pd.DataFrame(dictionaryDataNew)

In [14]:
weatherDataFrameNew

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     30     45.0
1      29.0     NaN     25      NaN
2       NaN    25.0     35      NaN

In [16]:
weatherDataFrameNew.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     30
1      29.0     NaN     25
2       NaN    25.0     35

In [17]:
weatherDataFrameNew.fillna(25)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     30     45.0
1      29.0    25.0     25     25.0
2      25.0    25.0     35     25.0

# GROUPBY

In [20]:
incomeDictionary = {"Departments" : ["Software","Software","Finance","Finance","Law"],
                    "Worker Name" : ["Yusuf","Mehmet","Zeynep","Esma","Ali"],
                    "Income" : [100,150,200,50,80]}

In [21]:
incomeDataFrame = pd.DataFrame(incomeDictionary)
incomeDataFrame

  Departments Worker Name  Income
0    Software       Yusuf     100
1    Software      Mehmet     150
2     Finance      Zeynep     200
3     Finance        Esma      50
4         Law         Ali      80

In [23]:
groupObject = incomeDataFrame.groupby("Departments")

In [24]:
groupObject.count()

             Worker Name  Income
Departments
Finance                2       2
Law                    1       1
Software               2       2

In [25]:
groupObject.mean()

             Income
Departments
Finance       125.0
Law            80.0
Software      125.0

In [26]:
groupObject.min()

            Worker Name  Income
Departments
Finance            Esma      50
Law                 Ali      80
Software         Mehmet     100

In [27]:
groupObject.max()

            Worker Name  Income
Departments
Finance          Zeynep     200
Law                 Ali      80
Software          Yusuf     150

In [28]:
groupObject.describe()

            Income
             count   mean         std    min    25%    50%    75%    max
Departments
Finance        2.0  125.0  106.066017   50.0   87.5  125.0  162.5  200.0
Law            1.0   80.0         NaN   80.0   80.0   80.0   80.0   80.0
Software       2.0  125.0   35.355339  100.0  112.5  125.0  137.5  150.0

# CONCATENATION (concat)

In [ ]:
## pd.concat([dataFrame1, dataFrame2, dataFrame3])

In [29]:
## with concat method, we add Data Frames to each other

# MERGE

In [30]:
## pd.merge(dataFrame1, dataFrame2, on="name")